初级要：

负责业务系统前端模块的设计与开发；
负责产品的需求分析，开发，测试，维护等各项工作；
承担PC端和移动端的前端HTML5的开发任务；
整体页面结构以及css样式层的设计，优化；
完成页面脚本程序编写，实现各类页面动态，交互效果；
能够理解后端架构，与后端工程师配合为项目提供最优化的技术解决方案。

中级要：

负责所在项目需求实现与开发；
完成系统细节技术设计，完成核心代码的编写；
确保需求实现，满足项目设计规范，软件编码规范以及性能要求；
测试，系统测试等；
积极沟通，以确保功能实现按时，按质交付；
积极参与阶段评审，满足项目过程质量需求，审核和指导开发人员。

已满足，走向高级开发（个人带领过小团队）：

负责大型系统的web前端开发
参与技术选型，推进应用和开发工作，支撑平台架构设计与开发功能
提升系统的整体用户体验，推动前端技术的发展
为提升团队开发效率，提炼公共组件，创造实用工具
优化现有业务，开发流程
关注前端发展，应用行业新技术
团队管理

作者：我是哪吒
链接：https://juejin.cn/post/6977214179149086751
来源：稀土掘金
著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。