
12.2
js基础 ，手写， css基础，算法， Webpack

12.3
RN，Flutter， taro，小程序

12.10 react vue node

02.10


主要从事前端相关的开发工作。参中台网站的建设，应用程序性能网站APM的建设，
以前也参与过公司跨平台的开发，对跨平台有比较深的了解，公司的RN业务，以及框架维护，以及CICD。参与Flutter框架的建设，以及业务开
发，落地公司第一个Flutter项目。
也参与过公司小程序的开发，
平时喜欢调研一些新技术以及分享，目前自己维护一个博客，记录以及收集一些好文章。目前访问量上千万，为团队分享Redux,Taro等。
目前的技术站主要是react，RN，flutter。
。。vue，angular，小程序技术站的项目也可以做。
上一家公司是上海京东，React相关项目开发，负责首页以及一些活动频道的开发，大促需求H5的一些开发。也参与RN相关的开发。


 Mobile Application Studio)，
为 App 开发、测试、运营及运维提供云到端的一站式解决方案，能有效降低技术门槛、减少研发成本、
提升开发效率，协助企业快速搭建稳定高质量的移动应用。

(Application Performance Management)，为线上APP质量实时、大数据、全覆盖、多维度监控和报警。