什么是Docker
Docker 是一个开源的应用容器引擎，可以让开发者打包他们的应用以及依赖包到一个轻量级、可移植的容器中，然后发布到任何流行的 Linux 机器上，也可以实现虚拟化。


前端学一点Docker，不信你学不会
https://juejin.cn/post/7304538094782808105?searchId=20231217152321A4613F8867D6CDCA211D

Docker 🔥🔥🔥🔥🔥🔥
Docker是一个开源的应用容器引擎，让开发者可以打包应用以及依赖包到一个可移植的镜像中，然后发布到Linux或windows操作系统的机器上。


Docker的好处是可以隔离环境


🐳Docker概念，工作流和实践 - 入门必懂    好好 技术蛋老师这     好呀------------------------
https://www.bilibili.com/video/BV1MR4y1Q738/?spm_id_from=333.337.search-card.all.click&vd_source=f180962fb6ac13c58e2bc143f0318c2a

https://juejin.cn/post/6954604160327090212
Docker 是一个开源的应用容器引擎，基于 Go 语言 并遵从 Apache2.0 协议开源。
Docker是什么 🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯🐯
https://www.bilibili.com/video/BV1tE41177BV/?spm_id_from=333.788.recommend_more_video.0&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a
==》Docker是一个开源的应用容器引擎
==》Docker,其实就是可以打包程序和运行环境，把环境和程序一起发布给容器，当你需要发布程序时，你可以使用Docker
==》将运行环境一起发布，其他人拿到你的程序后可以直接运行，避免出现一次编译到处调试的尴尬局面。
==》Docker的出现主要就是为了解决：“在我的机器上是正常的，为什么到你的机器上就不正常了的问题”

Docker 可以让开发者打包他们的应用以及依赖包到一个轻量级、可移植的容器中，
然后发布到任何流行的 Linux 机器上，也可以实现虚拟化。
容器是完全使用沙箱机制，相互之间不会有任何接口（类似 iPhone 的 app）,更重要的是容器性能开销极低。


 

https://www.bilibili.com/video/BV1NB4y117Zp/?spm_id_from=333.788&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a
01-Docker是什么?
02-Docker安装与卸载
03-Docker运行Nginx
04-Docker运行Java项目
05-Docker常用命令
06-Docker认证私有仓库
07-Docker基于容器创建一个新的镜像
08-Docker导入导出镜像
09-Docker镜像推送
10-Docker配置远程连接2375端口
11-Docker容器和宿主机文件互传
16-Docker可视化管理工具Portainer
17-Harbor私服部署
Docker-部署前端Vue项目
04-Docker-容器编排
Docker-学习笔记
解决Docker登录私有仓库时的密码安全问题
Docker日志文件大小控制&清理overlay2




【狂神说Java】Docker最新超详细版教程通俗易懂
https://www.bilibili.com/video/BV1og4y1q7M4/?spm_id_from=333.337.search-card.all.click&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a


 
Docker详解，7分钟学会 不错
https://www.bilibili.com/video/BV1Yh4y1K7ka/?spm_id_from=333.788.recommend_more_video.9&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a




Docker-部署前端Vue项目  好好好
https://www.bilibili.com/video/BV1ad4y1B7BH/?spm_id_from=333.337.search-card.all.click&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a


Docker 快速入门
https://docker.easydoc.net/doc/81170005/cCewZWoN/lTKfePfP
Docker 1小时快速上手教程，无废话纯干货
https://www.bilibili.com/video/BV19N4y1R735/?p=2&spm_id_from=pageDriver&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a



前端工程师也应该了解的docker 好文章、1. 前言
2. 什么是 docker？
3. Docker 的组成
3.1 docker 的感性理解
3.2 docker 使用流程
3.3 docker 常用指令
4. 部署前端项目
4.1 准备前端项目源码
4.2 添加 nginx.conf
4.3 添加 Dockfile
4.4 构建镜像
4.5 启动容器
4.6 自动化部署流程
4.7 小结
5. 部署 Node.js 应用
5.1 准备后端服务源码
5.2 添加 .dockerignore 和 Dockfile
5.3 构建镜像 + 启动容器
5.4 进入容器
6. 镜像推送
6.1 docker 登录
6.2 tag 标签设置
6.3 推送到镜像仓库
7. 总结
https://juejin.cn/post/7250029395023544376?searchId=2024010810125472897ECB1B3E5F18584A


🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥
https://www.bilibili.com/video/BV1MR4y1Q738/?spm_id_from=333.337.search-card.all.click&vd_source=f180962fb6ac13c58e2bc143f0318c2a 
容器Container
镜像Image
定制镜像文件DockerFile




下载镜像 ->通过镜像创建容器 ->启动运行容器



Docker-现代化应用部署的利器🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥
https://juejin.cn/post/7332027975862616073?utm_source=gold_browser_extension