都 2022 年了，手动搭建 React 开发环境很难吗？ https://juejin.cn/post/7087811040591675428 

React18 + React-Router v6 + TypeScript + Vite2 + Ant-Design 管理系统（开源啦🎉🎉） 🔥🔥🔥
https://juejin.cn/post/7114555646820745253
Vue3.2 + TypeScript + Pinia + Vite2 + Element-Plus 管理系统（开源啦🎉🎉）
https://juejin.cn/post/7080820051422478366

「超详细React项目搭建教程一」企业级前端开发规范如何搭建🛠 
「超详细React项目搭建教程二」集成 Webpack5/React17
「超详细React项目搭建教程三」集成 CSS/Less/Sass/Antd
「超详细React项目搭建教程四」集成图片/字体
「超详细React项目搭建教程五」集成 React-Router/Antd Menu
「超详细React项目搭建教程六」集成 Redux/Typescript
「超详细React项目搭建教程七」封装 Fetch 请求
「超详细React项目搭建教程八」使用 Redux-thunk实现Redux异步操作

https://gitee.com/dongtaotao/my.React.project.construction.tutorial/tree/master 
https://gitee.com/dongtaotao/React-cli

「超详细React项目搭建教程一」企业级前端开发规范如何搭建🛠
创建一个基础项目
添加 TypeScript
添加 ESLint 代码规范校验
添加 Prettier 代码自动格式化工具
添加 EditorConfig 代码风格统一工具
添加 stylelint
ESLint/Prettier/stylelint 工具库推荐
添加 Git Hook
Commit Message 规范
Commit message 格式
type
subject

「超详细React项目搭建教程二」集成 Webpack5/React17
https://juejin.cn/post/6947874258324946952
创建一个基础项目
添加 React
添加 React 根组件
添加 Babel
Babel 配置
添加 Webpack
开发环境配置
为开发环境添加 NPM 脚本
在 Webpack 中手动配置热更新插件
在 webpack 构建过程中添加类型检查
在 webpack 构建过程中添加代码规范校验
生产环境配置
为生产环境添加 NPM 脚本
抽离 Webpack 的公共配置
最后
参考文档

「超详细React项目搭建教程三」集成 CSS/Less/Sass/Antd  
https://juejin.cn/post/6947875008840466463
在代码中引入 CSS
为开发环境配置 CSS
为生产环境配置 CSS
为多个组件添加样式
使用 CSS modules
CSS modules 的引用方式优化
在项目中配置 Less
为组件添加 Less
在项目中配置 Sass
为组件添加 Sass
为项目添加 UI 库-Antd

「超详细React项目搭建教程四」集成图片/字体
https://juejin.cn/post/6947875454783062024
在代码中引入图片
配置 Webpack 以解析图片
在 CSS 文件中应用图片

「超详细React项目搭建教程五」集成 React-Router/Antd Menu
https://juejin.cn/post/6950162473106276360
安装依赖
路由基础配置
路由嵌套
配置式路由
侧边栏菜单
React Router + Antd 实现侧边栏菜单
布局文件
路由文件
渲染路由
渲染侧边栏菜单
常见问题
手动刷新子页面出现 404
不能在 if/循环语句中使用 React Hooks
最后
参考文章

「超详细React项目搭建教程六」集成 Redux/Typescript
安装依赖
State
Actions 和 action 创建函数
Reducer
Store
链接组件

TypeScript面试题及答案收录[不断更新] 
https://juejin.cn/post/6999985372440559624   


2021 年前端开发者需要知道的 JS/React 规范
https://juejin.cn/post/6950690579286065182 