低代码开发
https://www.bilibili.com/video/BV1YM4y1L7xJ?spm_id_from=333.337.search-card.all.click


vue实现一个低代码平台(上篇) 🔥 🔥 🔥 🔥 🔥 🔥 🔥 🔥 🔥 
https://www.bilibili.com/video/BV1w64y1676v?p=7        
vue实现一个低代码平台(下篇)
https://www.bilibili.com/video/BV1bg41177de?spm_id_from=333.999.0.0&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a


从零实现一个React可视化搭建组件库
https://juejin.cn/post/7208745710764867640?
项目管理工具： lerna
构建工具：
编辑器： vite
自定义组件库: rollup
前端框架/库: ts + react + redux-toolkit + redux-persist + react-router + react-dnd + antd
代码规范以及提交规范: eslint + prettier + husky + lint-stage + commitlint
单元测试: jest + react-testing-library
链接：https://juejin.cn/post/7208745710764867640


一个低代码（可视化拖拽）教学项目
可视化拖拽组件库一些技术要点原理分析
https://github.com/woai3c/Front-end-articles/issues/19
https://woai3c.github.io/visual-drag-demo/
本文主要对以下技术要点进行分析：
开源教你如何做一个低代码平台  重要
https://mp.weixin.qq.com/s?__biz=MjM5NDkxMTgyNw==&mid=2653073378&idx=2&sn=ab38f083eb6e3b2aa7a6ac87bd6b1da4&chksm=bd568cde8a2105c809db8044453d3bb8841d5d16025aad2226b9e2867645adf352595af65595&scene=27
https://github.com/woai3c/visual-drag-demo
编辑器
自定义组件
拖拽
删除组件、调整图层层级
放大缩小
撤消、重做
组件属性设置
吸附
预览、保存代码
绑定事件
绑定动画
导入 PSD
手机模式

https://toscode.gitee.com/gist006/vue-visual-drag
vue-visual-drag 是一个基于vue+element开发的大屏可视化拖拽项目，目前已经实现柱状图、折线图、饼图、水球图、词云图、地图、Table
表和日期等的拖拽和配置具体属性，有兴趣可以看看，如果对你有帮助，可以给个star。

vue-visual-drag-----------------
vue-visual-drag 是一个基于vue+element开发的大屏可视化拖拽项目，目前已经实现柱状图、   重要🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥
https://biubiubiu01.github.io/vue-visual-drag/#/  在线修改数据功能-----------------------------

折线图、饼图、水球图、词云图、地图、
Table表和日期等的拖拽和配置具体属性，有兴趣可以看看，如果对你有帮助，可以给个star。
https://toscode.gitee.com/gist006/vue-visual-drag

Low-Code 低代码平台思路 | 青训营笔记
https://juejin.cn/post/7130274439710638093#heading-10
页面预览与发布
页面保存

两种方式：保存 json树

保存到本地，通过 localStroage
保存到数据库，建立后台
预览

拿到页面 json 树，进行遍历渲染

手撸低代码平台搭建
撸低代码平台搭建（一）走进前端低代码
手撸低代码平台搭建（二）揭秘页面设计器
手撸低代码平台搭建（三）组件间交互的实现
手撸低代码平台搭建（四）组件拖动自由布局的实现
保存
保存时实际就是将这段json进行保存操作，我们可以将json存储到数据库中。
预览
在上面讲解画布区域时，我们已讲到组件如何通过json进行渲染。预览以及真实的页面渲染实际和画布中组件的展示实现原理完全一致。其中的区别有两点：（1）画布中的组件不支持交互操作，这里，我们需要屏蔽画布中组件的交互操作。我们可以通过css中的after伪类，设置content为""来实现。（2）画布中的组件需要包裹一个div，这个div包含了复制、删除等功能。

链接：https://juejin.cn/post/7015878414083031048

可视化拖拽组件库一些技术要点原理分析
https://juejin.cn/post/6908502083075325959#heading-21

前端低代码调研与总结 🍉🍉🍉
https://juejin.cn/post/7034052451573432351


GoView 开源，一个好用的 Vue3 低代码开发数据大屏系统 好好好🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥
https://blog.csdn.net/qq_40282732/article/details/124578653


【前端进阶】Vue低代码动态生成H5，上市公司实战分享
https://www.bilibili.com/video/BV1te411G7VJ/?p=5&spm_id_from=pageDriver&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a


如何用1分钟部署低代码项目
https://www.bilibili.com/video/BV1Ve411j7eL/?spm_id_from=333.337.search-card.all.click&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a

低代码从入门到实战：低代码引擎实践
https://www.bilibili.com/video/BV1aP4y1Q7Xa/?spm_id_from=333.788&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a


什么是低代码 h5低代码 react 
https://github.com/bubucuo/template
https://www.bilibili.com/video/BV1uz4y1a7mC/?spm_id_from=333.999.0.0&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a
如何用1分钟部署低代码项目
https://www.bilibili.com/video/BV1Ve411j7eL/?spm_id_from=333.999.0.0&vd_source=0c743a1becd4c9f9a0c3fcf9b6579f8a



低代码平台
《视搭》是一个视频可视化搭建项目。您可以通过简单的拖拽方式快速生产一个短视频，使用方式就像易企秀或百度 H5 等 h5 搭建工具一样的简单
https://github.com/tnfe/shida


Vue + Koa从零打造一个H5页面可视化编辑器——Quark-h5 很好🔥🔥🔥🔥🔥🔥🔥🔥
https://github.com/huangwei9527/quark-h5


基于 Vite2.x + Vue3.x + TypeScript H5 低代码平台 🔥🔥🔥🔥🔥🔥🔥
https://github.com/buqiyuan/vite-vue3-lowcode


lowcode-platform
https://github.com/edagarli/lowcode-platform


Mall-Cook 是一个SASS商城低代码可视化商城搭建平台，零基础可视化拖拽页面，支持构建H5、小程序多端商城应用
体验地址：http://110.42.184.128:8000/#/login
github地址：https://github.com/wangyuan389/mall-cook
推荐一个商城低代码平台 H5 很好很好
https://github.com/wangyuan389/mall-cook
推荐一个低代码平台，通过该平台你能快速搭建出一个商城应用。该开源项目基于 Vue.js 是一个不错的练手项目。
Awesome Github REPO 很好
https://github.com/Wechat-ggGitHub/Awesome-GitHub-Repo

逛逛GitHub 很好的文章
https://juejin.cn/column/6962165420291784717

前端工程化之低代码体系 https://juejin.cn/post/6943564601694879775

实践篇—低代码问卷平台 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥
https://juejin.cn/post/7078860542026186765

答题低代码 🔥🔥🔥🔥🔥🔥🔥🔥
https://gitee.com/surveyking/surveyking

从零设计可视化大屏搭建引擎 🔥🔥🔥🔥🔥🔥🔥🔥
https://juejin.cn/post/6981257575425654792
从零开发一款可视化大屏制作平台
https://juejin.cn/post/6937257727106220040
如何搭积木式的快速开发H5页面?
https://juejin.cn/post/6904878119724056584
基于React+Koa实现一个h5页面可视化编辑器－Dooring | 🏆 技术专题第三期征文
https://juejin.cn/post/6864410873709592584


数据可视化平台 [vue+webpack + node + echarts + d3实现方案]
https://juejin.cn/post/6901317922837397518?share_token=ce205666-ea61-4249-a646-a32cf562893b

推荐20个开源的前端低代码项目
https://juejin.cn/post/7164694758588153863


低代码可视化编辑平台 https://juejin.cn/post/6930506113553006599
🔥🔥🔥🔥🔥🔥🔥

低代码海报平台的编辑器难点剖析
https://juejin.cn/post/7153474886822952991
如何设计一款营销低代码可视化海报平台
https://juejin.cn/post/7146402302130126862
聊聊低代码海报平台的服务端架构设计
https://juejin.cn/post/7169807068608593957
低代码平台的撤销与重做该如何设计？
https://mp.weixin.qq.com/s?__biz=Mzg3MTU4NTI3OA==&mid=2247491868&idx=1&sn=e80ea3530008f237ad59c3810cd0dcf1&chksm=cefee58df9896c9b431ab3846b52cb1a00f27db5349fb23c1387c2d4031e83d1ed7b4c1844de&token=68340559&lang=zh_CN#rd




低代码可视化平台搭建 🍉🍉🍉
https://juejin.cn/post/7195753369985794109#heading-23

我的低代码框架是如何生成源码的？ react 🍉
https://juejin.cn/post/7206955531998773309
https://github.com/ccj-007/easy-lowcode

2022年度国内主流低代码平台介绍
https://juejin.cn/post/7165836431112273951


低代码 yyds  项目  很多项目 h5
https://juejin.cn/post/6984053870121091103



浅谈低代码平台远程组件加载方案
http://zoo.zhengcaiyun.cn/blog/article/low-code




面试被问到低代码细节？听我这样吹🤯（含架构和原理）
https://juejin.cn/post/7276837017231835136?searchId=2023092113544964AE07D93CCEEF99623C


🤔如何实现一个可视化搭建平台🧐 | 移动端商城
https://juejin.cn/post/7284881709045137467?utm_source=gold_browser_extension 


Vue3问题：如何实现组件拖拽实时预览功能？ 
https://juejin.cn/post/7297093747703005235?utm_source=gold_browser_extension