
面试官你好，我叫----，我目前在上海-----基础平台架构组，在自-----已经三年多了，
目前主要负责公司性能监控分析平台网站的建设，
负责项目整体技术架构以及研发工作，整体框架搭建，技术方案制定，性能优化，
制定开发规范，推动前端工程化等
带领一个小团队参与项目开发，--------是项目负责人。
同时也维护公司基础组建库，JSSDK技术框架，
以及参与公司运营后台，以及H5相关的开发开发。
前期参与过公司React-Native 框架建设，维护以及业务开发。
也参公司Flutter框架的建设，落地公司第一个Flutter项目。
对前端，web，H5，Hybrid，以及跨平台端等技术有着丰富的开发经验。
主要技术站是有react，vue，小程序，RN，flutter的等。
平时喜欢调研一些新技术，看一些技术文章
平时也会写技术博客，总结学习（目前个人维护的 CSDN 技术博客访问量已经达到一千多万条了，
自己写了三百多篇文章）。
上一家公司是在上海京东。在京东业主要从事前端相关的项目开发
1.公司组织架构
上海-----基础平台架构组， 这个大组里面又分为好几个小组
业务领域： 平台 -公司App中台门户- 性能监控分析平台 - 打包发布基础设施平台CICD
跨平台开发框架：native框架， RN框架，Flutter框架，Card框架 以及 Hybrid框架 web架构组  H5架构组。
架构师-------------------
1.负责搭建前端框架，技术方案设定，组件库搭建，性能优化相关工作。
    比如： 前端脚手架、组件库、工具库、私有仓库、接口系统、文档系统、监控系统、CICD等
3.推动前端工程化建设（自动化和工具化）
    前端工程化包括前端的模块化、组件化、规范化，自动化，前端性能优化，前端性能监控等一系列知识
4.负责业务场景下的技术难点攻坚
5.分析项目中的难点，痛点，给出解决方案 ------- 
6.负责指导组内成员，提升团队成员技术水平
7.负责前沿技术研究和新技术调研，要有快阔的技术视野，不仅仅在H5端，web端，小程序，跨平台，
8.建立技术氛围&技术成长（不要影响开发进度，技术调研，技术分享，鼓励分享，兴趣小组）等

2.制定开发规范，搭建工程体系，提升开发效率和产品质量
    目录结构的制定，编码规范化，前后端接口规范，需求文档规范化，git分支管理，组件库文档规范，
    Commit提交描述规范，codeReview规范
----------前端项目负责人
目标：保证项目按时、按质量的交付上线，以及上线之后的安全稳定运行。
把控需求
技术方案设计
开发
监督代码质量
把控项目进度
稳定安全的运行  

平时喜欢研究技术，以及看看技术文章，自己也写技术博客，目前自己的自己磨课访问量一千多万了。
然后也打打球，足球也提。    
