如如果果你你是是一一个个项项目目的的前前端端技技术术负负责责人人，
你你的的主主要要职职责责是是什什 么么？？
保证项目按时、按质量的交付上线，以及上线之后的安全稳定运行

指责
把控需求
技术方案设计
开发
监督代码质量
跟踪进度
稳定安全的运行

//
技术选型选什么
前端框架（vue， react， angular node.js等）
语言（js，ts）
其他（构建工具，CI/CD 等）

技术没有好坏之分，看是否适合自己


技术选型的依据
社区是否已经足够成熟
公司是否已经有经验积累
团队成员的学习成本

要全面考虑各种成本
学习成本
管理成本（如用ts遍地any怎么办）
运维成本
升级成本

要站在团队的角度，而非个人的角度


code review ================================================
1.代码规范（eslint不能全检查，如变量命名，代码语义）
2.重复代码需要抽离，复用
3.单个函数内容过长，需要拆分
4.算法复杂度是否可用？是否可继续优化
5.是否有安全漏洞
6.扩展性如何？（不用为了扩展而扩展，不封闭即可）
7.是否和现有功能重复了
8.是否有完善的单元测试
9.组件设计是否合理

code review的时机
1.提交PR或者MR时，通过代码diff进行code review
2.每周例行一次集体code review

持续优化
1.每次code review的问题要记录下来
2.归纳整理，形成自己的代码规范体系
3.新加入的成员要提前学习，提前规避


如何学习一门新语言，需要考虑哪些方面
1.它的优势和应用场景
2.语法（常量，变量）
3.内置模块和api
4.常用的第三方框架和库
5。开发环境和调试环境
6.线上环境和发布过程

你觉得自己还有哪些不足之处？

怎么详细介绍一个前端项目？
https://www.zhihu.com/question/293521236/answer/2378054875

前端项目负责人在项目初期需要做什么？ ******************************
https://juejin.cn/post/6968874442554343455

前端项目负责人最基础的需要会哪些
https://juejin.cn/post/6971116221521461262

前端项目负责人需要具有的能力
https://juejin.cn/post/6946210273061502990
1.技术能力
2.规划能力
3.业务能力
4.协作能力
5.沟通能力
6.判断能力
7.框架能力
8.架构能力
9.心理能力

07.二面 1：如何回答常见的软技能问题
https://juejin.cn/post/6844904100451057672
08.二面 2：如何介绍项目及应对项目细节追问
https://juejin.cn/post/6844904100459446279
