如果你是一个项目的前端技术负责人，
你的主要职责是什么？？
   保证项目按时、按质量的交付上线，以及上线之后的安全稳定运行
把控需求
技术方案设计
开发
监督代码质量
跟踪进度
稳定安全的运行

如何管理好你团队的前端代码
https://blog.51cto.com/u_9177933/3176716


项目负责人需要什么， https://juejin.cn/post/6971116221521461262
1.技术能力-----   基础技术以及项目经验---可以指导同事解决问题
2.规划能力-----   技术体系规划---人力资源规划----任务划分规划------风险规划------突发情况应对能力
3.业务能力----- 整体业务目标是什么---梳理业务流程-----参与需求评审---考虑业务和技术的实现方案
4.协作能力-------与团队的协作以及项目烟对的协作
5.沟通能力-------表达方式---
6.判断能力-------技术判断，风险判断，决策判断
7.框架能力与架构能力-------


作为一个前端小领导 ------------==========
1.要做好人员管理 人员管理  
新人培训 （导师制规范文档沉淀） 人员成长（技术成长靠个人管理上的成长靠组织） 绩效考核/激励（创造价值，开发需求记录在案数据说明一切）
团队氛围（一个月团建一次多分享）公平公正公开（任务需求和开发要有记录，数据说明一切）
2.定制研发流程
3.保证代码代码质量
4.提升开发效率（开发工具，通用组件封装，通用技术类型抽象，多分享）
5.制定技术规范（代码规范，数据库设计规范，其他命名规范）
// 6.文档沉淀（技术文档沉淀）
// 7.工作汇报
8.技术氛围&技术成长（不要影响开发进度，技术调研，技术分享，鼓励分享，兴趣小组）
9.绩效考核 上下游定制统一的ork以及kpi，朝着一个目标前进

研发流程
需求预审
   技术负责人和产品评审，拒绝不合理的需求
需求评审
   技术和产品评审，讨论合理方案
分配任务
   技术负责人分配
技术方案
   开发多写技术方案，有记录
技术方案评审
   开发评审技术方案，有助于大家互相学习提升，保证项目质量
开发排期
   开发自己安排工作
开发
   开发写代码 自测、联调 
   开发自测，减少测试工作量，保证代码质量
   code review
   必须执行，保证代码质量，互相学习成长
体验
   产品发现问题
测试
   性能测试和功能测试
发布
   最好自动化一点
   bug修复
线上bug记录，修复，目的是为了减少bug


//
技术选型选什么
前端框架（vue， react， angular node.js等）
语言（js，ts）
其他（构建工具，CI/CD 等）

技术选型的依据
社区是否已经足够成熟
公司是否已经有经验积累
团队成员的学习成本

要全面考虑各种成本
学习成本
管理成本（如用ts遍地any怎么办）
运维成本
升级成本

要站在团队的角度，而非个人的角度

code review ================================================
1.代码规范（eslint只是风格检查，如变量命名，代码语义）
2.重复代码需要抽离，复用
3.单个函数内容过长，需要拆分
4.算法复杂度是否可用？是否可继续优化
5.是否有安全漏洞
6.扩展性如何？（不用为了扩展而扩展，不封闭即可）
7.是否和现有功能重复了
8.是否有完善的单元测试
9.组件设计是否合理

code review的时机
1.提交PR或者MR时，通过代码diff进行code review
2.每周例行一次集体code review

持续优化
1.每次code review的问题要记录下来
2.归纳整理，形成自己的代码规范体系
3.新加入的成员要提前学习，提前规避

你觉得自己还有哪些不足之处？

怎么详细介绍一个前端项目？
https://www.zhihu.com/question/293521236/answer/2378054875

前端项目负责人在项目初期需要做什么？ ******************************
https://juejin.cn/post/6968874442554343455

前端项目负责人最基础的需要会哪些
https://juejin.cn/post/6971116221521461262

前端项目负责人需要具有的能力-------
https://juejin.cn/post/6946210273061502990
技术能力 规划能力  业务能力  协作能力  沟通能力 判断能力  框架能力  架构能力

07.二面 1：如何回答常见的软技能问题
https://juejin.cn/post/6844904100451057672
08.二面 2：如何介绍项目及应对项目细节追问
https://juejin.cn/post/6844904100459446279


你还有什么想要问我的么-------------------
我一般会问技术团队的规模

技术团队有几个人，
几个前端，
几个后端，
高级，中级，初级的分别是多少人

然后就是技术栈

目前在使用什么技术栈
将来打算使用什么技术栈
自己是否可以决定未来技术栈的走向

然后是自己在团队中的角色

负责什么工作
对于项目的决策度
链接：https://juejin.cn/post/7064740689178787871

团队管理
https://juejin.cn/column/7090496324948688910
从零开始搞基建（4）——单元测试 
https://www.cnblogs.com/strick/p/15394115.html

跳槽面试技巧记录 很好的文章 https://juejin.cn/post/7090733245590929421 🔥🔥🔥🔥

中级要：
负责所在项目需求实现与开发；
完成系统细节技术设计，完成核心代码的编写；
确保需求实现，满足项目设计规范，软件编码规范以及性能要求；
测试，系统测试等；
积极沟通，以确保功能实现按时，按质交付；
积极参与阶段评审，满足项目过程质量需求，审核和指导开发人员。

已满足，走向高级开发（个人带领过小团队）：
负责大型系统的web前端开发
参与技术选型，推进应用和开发工作，支撑平台架构设计与开发功能
提升系统的整体用户体验，推动前端技术的发展
为提升团队开发效率，提炼公共组件，创造实用工具
优化现有业务，开发流程
关注前端发展，应用行业新技术
团队管理
链接：https://juejin.cn/post/6977214179149086751

工作一年半，总结出这份前端研发流程图
https://juejin.cn/post/7039330160885104653

我是如何带领团队从零到一建立前端规范的？🎉🎉🎉
https://juejin.cn/post/7085257325165936648
开发者需要建立和遵守的规范
大致可以划分成这几个方向：

开发流程规范
代码规范
git commit规范
项目文件结构规范
UI设计规范

Code Review最佳实践 https://juejin.cn/post/7077372861073063950

为什么需要Code Review
什么时候做Code Review
Committer需要注意什么
Code Reviewer需要看哪方面的内容

为什么需要Code Review
    可以提高committer对于自己代码的要求
    可以让开发更加深刻的理解需求
    组内知识分享
    保持项目代码风格的一致性
    提前发现代码的问题
什么时候进行Code Review
    开发前
    开发中
    提测前
    上线后
Committer需要注意什么
    限制每个commit的改动大小和范围
    Commit信息要有意义
Code Review需要看什么东西
    正确实现了功能或者修复了bug
    确保编码风格一致
    避免非必要的复杂逻辑设计
    避免硬编码
    提高代码复用率
    写上必要的代码注释
带上必要的自动化测试
总结
个人技术动态


谈谈你的项目经历？
https://juejin.cn/post/6905604366792458248

跳槽面试技巧记录 https://juejin.cn/post/7090733245590929421
）项目管理上，你的项目是怎么分配的？成员之间是怎么协作的？


说下单点登录
参考答案：
SSO 一般都需要一个独立的认证中心（passport），子系统的登录均得通过 passport，子系统本身将不参与登录操作，当一个系统成功登录以后，passport 将会颁发一个令牌给各个子系统，子系统可以拿着令牌会获取各自的受保护资源，为了减少频繁认证，各个子系统在被 passport 授权以后，会建立一个局部会话，在一定时间内可以无需再次向 passport 发起认证。
具体流程是：

用户访问系统 1 的受保护资源，系统 1 发现用户未登录，跳转至 sso 认证中心，并将自己的地址作为参数
sso 认证中心发现用户未登录，将用户引导至登录页面
用户输入用户名密码提交登录申请
sso 认证中心校验用户信息，创建用户与 sso 认证中心之间的会话，称为全局会话，同时创建授权令牌
sso 认证中心带着令牌跳转会最初的请求地址（系统 1）
系统 1 拿到令牌，去 sso 认证中心校验令牌是否有效
sso 认证中心校验令牌，返回有效，注册系统 1
系统 1 使用该令牌创建与用户的会话，称为局部会话，返回受保护资源
用户访问系统 2 的受保护资源
系统 2 发现用户未登录，跳转至 sso 认证中心，并将自己的地址作为参数
sso 认证中心发现用户已登录，跳转回系统 2 的地址，并附上令牌
系统 2 拿到令牌，去 sso 认证中心校验令牌是否有效
sso 认证中心校验令牌，返回有效，注册系统 2
系统 2 使用该令牌创建与用户的局部会话，返回受保护资源

作者：一只前端小菜鸟
链接：https://juejin.cn/post/7095945284504518663
来源：稀土掘金
著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。


    // 根据性能数据，每个维度的去分析数据。
    //     比如拿崩溃分析来说： 分成三个部分，  
    //     1.筛选， 可以更具 语言特性筛选，比如 java的奔溃，js的奔溃，dart的奔溃，oc的崩溃
    //     2.更具框架筛选。 原声框架。RN，Flutter ，小程序
    //     3.地区，大陆，台湾，海外
    //     4.根据cpu架构
    //     5.操作系统
    //     6.具体模块
    //     7.责任人
    //     8.机型
    //     9.厂家
        // DashBoard：
        //     主要是已可视化图表展示（折线图曲线图等），主要有启动崩溃率 实时崩溃数 崩溃率占比  崩溃率分布 等可以对比每个版本的的崩溃率
        //     接入订阅报警（可以手动触发报警）
        // 崩溃报告： 1.责任人。数量占比 2.具体模块， 数量占比 3库名，类名。数量占比 4崩溃行 责任人，数量 百分比
        //     5.操作系统版本 6.渠道号 7.设备ID
        // 崩溃分析：具体崩溃行(责任人，数量，百分比，pms状态)  崩溃详情（崩溃信息 堆栈相关）
        //     和公司PMS系统打通，可以生成pms指定责任人去修改bug状态。。。。。。责任人制定某一个开发去修改，修改完成会变成已完成=== 在PMS中跟踪指定崩溃问题


🌰更好的实现前端工程化 
前端工程化不单单包括前端的模块化、组件化、规范化，自动化，
还包括前端性能优化，前端目录规划，前端规范化，自动化测试，前端发布部署，性能监控等等一系列知识。 
为什么要工程化
方便管理、专注开发、快速迭代等

前端工程化不是某个具体的工具，而是对项目的整体架构与整体规划，使开发者能在未来可判时间内动态规划发展走向，以提升整个项目对用户的服务周期。

前端工程化领域实践，利用工程架构的知识重构了众多项目，
🔥🔥🔥包括但不限于脚手架、组件库、工具库、多包仓库、私有仓库、接口系统、文档系统、监控系统、CICD、可移植容器
提高效率和降低成本，

🌰为什么要做前端工程
降本提效，保障质量
提高效率(通过模块/组件化复用各项能力，以及自动化工具提高效 率)
保障质量(规范化避免犯错，通过引入准入检测、监控、自动化测试 等手段保障研发和运维期间的质量)
降低成本(提高质量、保障质量，以及自动化带来的开发难度的降低 变相的就降低的整个软件开发的成本)

🔥🔥🔥 🔥🔥🔥🔥调研ElasticSearch搜索与分析的技术，对接ElasticSearch查询，封装查询语法，提高查询效率。
Elasticsearch是一种分布式的海量数据搜索与分析的技术，用于对海量的数据进行近实时的数据分析
Elasticsearch天生为分布式执行数据分析操作而生的架构，海量数据量级下的近实时（秒级）性能支持，以及无比强大的搜索和聚合分析的语法支持，
   让ES更加适合进行大数据场景下的数据分析应用。
Elasticsearch 是一个高度可扩展的开源全文本搜索和分析引擎。 它使你可以快速，近乎实时地存储，搜索和分析大量数据。 
   它通常用作支持具有复杂搜索功能和要求的应用程序的基础引擎/技术。
Elasticsearch是一款强大的搜索和分析数据引擎
npm install elasticsearch
https://juejin.cn/book/7054754754529853475
在互联网、大数据、人工智能高速发展的今天，对于海量数据的存储和检索已然成为刚需。
毕竟从某种层面来讲，谁掌握了数据，谁就掌握了主动权。是的，那些看似杂乱无章的数据可能蕴含着无数的“金银财宝”，
但前提是你得有存储、处理、检索、展现的能力。
Elasticsearch 作为搜索引擎领域的后起之秀，从发布之初到现在已经得到了飞速的发展。其凭借着开源、分布式、RESTFul 等特点，
成为了现今最热门的搜索引擎。作为 Elastic Stack 的核心，Elasticsearch 可以集中存储你的数据，
帮助你发现意料之中以及意料之外的情况。通过 Elasticsearch，你可以轻松地存储、搜索、分析大量数据。
除了搜索领域外，Elasticsearch 与 Kibana、Logstash 组成的 ELK 系统还可以应用到日志采集、分析、监控等领域。

所以说，使用 Elastic Stack 的解决方案可以安全可靠地存储任何来源、任何格式的数据，
然后实时地对数据进行搜索、分析和可视化。借助 Elastic Stack 提供的解决方案，你可以轻松解决海量数据面临的存储、处理、分析、检索、展现的问题。


前端架构师、前端主管、资深/专家级前端开发。