谈谈你对前端工程化的理解
https://zhuanlan.zhihu.com/p/141195603

【前端工程化】- 结合代码实践，全面学习前端工程化 🔥
https://juejin.cn/post/7033355647521554446

【青训营】- 了解前端工程化
https://juejin.cn/post/7009595995960901645

面试题总结  慕课网 https://juejin.cn/column/7093435609905102884
562 - 2周刷完100道前端优质面试真题 - 完结

如何从零到一建立一套完整的 前端规范【前端Leader必看】
https://juejin.cn/post/7094059147087314981

前端搞监控|Allan - 如何实现一套多端错误监控平台
https://zhuanlan.zhihu.com/p/158079491

前端监控  珠峰架构
https://www.bilibili.com/video/BV19a411A72Y?p=1

万字前端效率大提速系列 🚀 ：十、前端错误监控、数据监控专题
https://juejin.cn/post/7086378709560590343

一篇讲透自研的前端错误监控
https://juejin.cn/post/6987681953424080926 


脚手架 
脚手架的作用 
减少重复性的工作，不需要复制其他项目再删除无关代码，或者从零创建一个项目和文件。 
可以根据交互动态生成项目结构和配置文件。 
多人协作更为方便，不需要把文件传来传去。 
.实现思路 
项目模板放在github上 
用户通过命令交互的方式下载不同的模版 
经过模版引擎渲染定制项目模版 
模版变动，只需更新模版即可，不需要用户更新脚手架 
设计模块知识点 
commander.js命令行工具 
download-git-repo: 用来下载远程模板 
inquirer: 交互式命令行工具 
ora: 显示loading动画 
chalk: 修改控制台输出内容样式 
log-symbols: 显示出 √ 或 × 等的图标 

从 0 到 1 落地前端工程化 掘金小册
https://juejin.cn/book/7034689774719860739

前端工程化体系建设从理念到实战
https://www.bilibili.com/video/BV1gV41177Bh?spm_id_from=333.880.my_history.page.click


《前端那些事》从0到1开发工具库 🔥 
https://juejin.cn/post/6844904127923765256

前端工程化
https://juejin.cn/column/6981408568612225055

前端工程化体系建设从理念到实战  视频
https://www.bilibili.com/video/BV1gV41177Bh?p=9 


Babel配置傻傻看不懂？
https://juejin.cn/post/6863705400773083149
Babel工作原理本质上就是三个步骤：解析、转换、输出，

树酱的前端知识体系构建（上）
https://juejin.cn/post/6855468132186882055

树酱的前端知识体系构建（下）
https://juejin.cn/post/6860018724221976584

我和JSON Schema的那些事 low-code
https://juejin.cn/post/7038763751293583367


Git提交规范保护
https://juejin.cn/post/7034461103983689764

前端代码规范
https://juejin.cn/column/7044785295664873502
husky-hook，安装即可校验message是否符合规范
https://juejin.cn/post/7044484667893874719

Git commit message 规范
https://mp.weixin.qq.com/s?__biz=Mzk0NTI2NDgxNQ==&mid=2247484342&idx=2&sn=12f331dbd4b03baef771f75c9a426f07&chksm=c3194276f46ecb603b1c5b863ef2b683adf618d1ae1b231743e003fd0386387004e913a3ab8d#rd


git操作与分支管理规范  
https://juejin.cn/post/6892671601175691272

项目中的一些配置文件怎么配呢
.editorconfig文件配置
.prettierrc配置文件 .prettierignore忽略文件
.eslintrc.js
Husky配置
Commitizen
Commitlint
https://juejin.cn/post/7100219767335682061#heading-5


工作一年半，总结出这份前端研发流程图
https://juejin.cn/post/7039330160885104653

我是如何带领团队从零到一建立前端规范的？🎉🎉🎉
https://juejin.cn/post/7085257325165936648
开发者需要建立和遵守的规范
大致可以划分成这几个方向：

开发流程规范
代码规范
git commit规范
项目文件结构规范
UI设计规范


前端性能优化方法与实战
https://kaiwu.lagou.com/course/courseInfo.htm?courseId=638#/content?courseId=638&isShowSections=true 


Verdaccio 搭建 npm 私有仓库 
https://juejin.cn/post/7060327687851606047

前端工程化：保姆级教学 Jenkins 部署前端项目
https://juejin.cn/post/7102360505313918983