flutter：快速建构App，常用三方库汇总。【涵盖各种功能和业务】 
https://juejin.cn/post/7308553288399355930?utm_source=gold_browser_extension
App 架构
1. 屏幕适配
2. 路由
3. 网络请求
4. 权限申请
5. 状态管理
6. 嵌套地狱（ widget ）
7. 实时崩溃上报
UI 交互
1. 图片加载（缓存）
2. 上拉下拉（刷新）
3. 提示（toast）
4. webview
5. 二维码
6. 唤起三方应用（URL schema）
7. 文本大小自适应
8. 可见性监听（widget）
9. 图片预览（支持缩放）
数据存储
1. 本地数据库
2. 键值对存储（sp）
数据处理
1. 唯一值（uuid）
2. 精度处理（数值计算）
3. 加解密
4. base64
设备信息
1. 获取ip
2. 包信息
3. 设备信息
JSON 数据处理
1. 序列化
2. 模型解析
文件相关
1. PDF预览
2. 保存到相册
3. 拍照、相册选择
4. 文件选择（支持多文件）
5. 获取系统文件路径
特殊需求
1. 双屏应用（一般用于收银设备）
2. HTML解析
3. Windows常用API
4. 文字播报
5. 播放本地音频
6. ijk视频播放器
7. 连接电子秤
8. 小票标签打印
9. 扫码监听
10. 桌面应用窗口大小可调整
11. 地图定位
12. 手写签名  